{
    "recipes": [
        { "id": 1,
      "name": "Nehari",
      "category": "Main Courses - Beef",
      "ingredients": [
        "Beef 1 kg (boiled)",
        "Onion 1",
        "Lemon 2",
        "Star anise 4",
        "Green chili 6",
        "Oil 1 cup",
        "Stock 4 cup",
        "Coriander leaves ½ bunch",
        "Mint leaves ½ bunch",
        "Dry ginger powder 1 tsp",
        "Turmeric powder 1 tsp",
        "Garam masala powder 1 tsp",
        "Nutmeg ½ tsp",
        "Mace ½ tsp",
        "Chili powder 2 tsp",
        "Ginger garlic paste 2 tsp",
        "Coriander powder 2 tsp",
        "Cumin seeds 2 tsp",
        "Fennel seeds 2 tsp",
        "Wheat flour 4 tbsp",
        "Salt to taste"
      ],
      "instructions": [
        "In a pan, roast cumin seeds, star anise, nutmeg, mace, fennel seeds and dry ginger powder.",
        "Now grind the roasted spices well.",
        "Now add in chili powder, turmeric powder, fennel seeds, garam masala powder and salt.",
        "Mix well and divide the mixture in two parts.",
        "Heat oil in pan, add ginger garlic paste and fry.",
        "Mix spice mixture and coriander powder in 1 cup water and add to the oil.",
        "Fry well. Add boiled beef and fry.",
        "Now add stock and cook well till the mixture starts boiling.",
        "Now roast wheat flour and dissolve in some water.",
        "Put wheat mixture to the pan while moving spoon and cook for 10 minutes more.",
        "Now turn the flame off.",
        "In other pan heat ½ cup oil, add chopped onion and remaining roasted spice mixture.",
        "Pour this on top of Nihari.",
        "Serve with lemon cut into halves, chopped green chilies, coriander leaves and mint leaves."
      ]
    },
    {
      "id": 2,
      "name": "Hyderabadi Tala Hua Gosht",
      "category": "Main Courses - Beef",
      "ingredients": [
        "Undercut meat ½ kg (cubed)",
        "Ginger garlic paste 2 tsp",
        "Red chili powder ½ tsp",
        "Turmeric powder ½ tsp",
        "Garam masala powder ½ tsp",
        "Meat tenderizer 1 tsp",
        "Salt to taste",
        "Oil 4 tbsp",
        "Mint leaves and lemon wedges for garnish"
      ],
      "instructions": [
        "Mix ginger garlic paste, red chili, turmeric, garam masala, meat tenderizer and salt. Marinade meat with the above spices and leave for 1 hour.",
        "Heat oil in deep pan and fry meat on high flame.",
        "Add ½ cup water in meat. Cover and cook on slow flame until meat tender and water dries.",
        "Garnish with mint leaves and lemon wedges and serves with mint dip."
      ]
    },
    {
      "id": 3,
      "name": "Maghaz Masala",
      "category": "Main Courses - Beef",
      "ingredients": [
        "Veal brain 2",
        "Onion 4 chopped",
        "Lemons 4",
        "Green chili 4 chopped",
        "Black pepper 8 cloves",
        "Garlic 6-8 cloves",
        "Chopped coriander 1 bunch",
        "Oil 1 cup",
        "Water 2 cup",
        "Yogurt ½ cup",
        "Turmeric 1tsp",
        "Whole spices 1tsp",
        "Ginger garlic paste 1tbsp",
        "Red chili powder 1tbsp",
        "Ginger paste 2 tbsp",
        "Coriander powder 2tbsp",
        "Salt to taste"
      ],
      "instructions": [
        "Boil the veal brain with 2 cup of water, garlic cloves and black pepper.",
        "Now clean the veal brain and cut into pieces.",
        "In another pan fry the onions till they turn golden brown. Remove and place on an absorbent paper.",
        "Now crush half of the onions by hand.",
        "Heat oil in a pan and add red chili powder, turmeric powder whole spices, ginger garlic paste, yogurt and veal brain pieces.",
        "Now don't stir but move the pan around by hand.",
        "When the oil floats on top add lemon juice, chopped coriander, chopped green chilies and ginger.",
        "Cook for 5 -7 minutes.",
        "In the end serve in a dish with little bit of chopped coriander, ginger, green chili and whole spices."
      ]
    },
    {
      "id": 4,
      "name": "Zafrani Paaye",
      "category": "Main Courses - Beef",
      "ingredients": [
        "Trotters 1 pair (boiled)",
        "Oil 1 cup",
        "Onion 2 (chopped)",
        "Yogurt 125 gm",
        "Coriander powder 1 ½ tsp",
        "Chili powder 2 tsp",
        "Nutmeg ½ tsp",
        "Mace ½ tsp",
        "Turmeric ½ tsp",
        "Saffron ½ tsp",
        "Ginger garlic paste 1 tbsp",
        "Salt to taste",
        "Stock 6 cup",
        "All spice powder 1-12 tsp",
        "Green cardamom 4",
        "Black cumin seeds 1 tsp (crushed)",
        "Coriander leaves for garnishing",
        "Green chilies for garnishing",
        "Lemon for garnishing",
        "Mint leaves for garnishing",
        "Ginger for garnishing (juliennes)"
      ],
      "instructions": [
        "Heat oil in a pan.",
        "Add onion and fry till its color turn to golden brown.",
        "Now mix together yogurt, coriander powder, chili powder, nutmeg, mace, turmeric, saffron, ginger garlic paste and salt.",
        "Add this to the pan and fry well.",
        "Now add trotters and continue to fry.",
        "Add stock, cover and cook over low flame for 30 minutes.",
        "Turn the flame off.",
        "Add all spice powder, green cardamom and black cumin seeds.",
        "Serve with coriander leaves, green chilies, lemon, mint leaves and ginger juliennes."
      ]
    },
    {
      "id": 5,
      "name": "Bong Do Piyaza",
      "category": "Main Courses - Beef",
      "ingredients": [
        "Round meat ½ kg",
        "Clarified butter 1 cup",
        "Black cardamom 3 - 4 (whole)",
        "Bay leaves 2 – 3",
        "Red chili 6 - 8 (whole)",
        "Black pepper 1 tsp (whole)",
        "Cinnamon sticks 3 – 4",
        "Ginger garlic paste 2 tbsp",
        "Yogurt 250 gm (whisked)",
        "Onion 4 (sliced)",
        "All spice powder 1 tbsp",
        "Green chilies 6 – 8 (chopped)",
        "Salt to taste"
      ],
      "instructions": [
        "In a pan heat clarified butter with black cardamom, bay leaves, red chili, black pepper and cinnamon sticks to crackle.",
        "Then add meat pieces to cook till it turn brown.",
        "Then add ginger garlic paste to saute.",
        "Now put yogurt and again cook for 2 to 3 minutes to saute.",
        "Now pour as required water to cook till meat tender.",
        "Then add onion, all spice powder, green chilies and salt to mix and cook till it turn thick.",
        "Dish it out and serve."
      ]
    },
    {
      "id": 6,
      "name": "Afghani Kabab",
      "category": "Main Courses - Beef",
      "ingredients": [
        "Mince Meat 1 kg",
        "Egg 1",
        "Salt to taste",
        "Black pepper 1 tsp (crushed)",
        "Garlic Ginger Paste 1 tbsp",
        "Onions 2",
        "Fresh Coriander 1 bunch",
        "Green chilies 4",
        "Tomatoes 1 kg",
        "Lemon 1",
        "Oil 1 cup"
      ],
      "instructions": [
        "Take mince, crushed black pepper, eggs, salt, green chilies, coriander and onion in a bowl and mix well all the ingredients and make dough, leave for half hour.",
        "Take a pan and put tomatoes, ginger garlic paste, crushed black pepper, salt and half cup oil in it and cook on low flame.",
        "When the water of the tomatoes dries then sauté.",
        "Heat oil in a frying pan and shallow fry the kabas.",
        "Add tomato paste.",
        "Afghani kabab are ready to serve with hot roghni nans."
      ]
    },
    {
      "id": 7,
      "name": "Haleem",
      "category": "Main Courses - Beef",
      "ingredients": [
        "Mutton/Beef 1 kg",
        "Wheat grain ½ kg",
        "Yogurt ¼ kg",
        "Ginger garlic paste 2 tbsp",
        "Gram lentil ½ cup",
        "Urad dhal ½ cup",
        "Mong dhal ½ cup",
        "Barely ½ cup",
        "Clarified butter 2 tbsp",
        "Onions 2 (fried brown)",
        "Green chili 6",
        "Oil 1 cup",
        "Red chili powder 2 tsp",
        "Turmeric 2 tsp",
        "Garam masala powder 2 tsp",
        "Salt to taste",
        "Cinnamon stick 2",
        "Black pepper corn 1 tsp",
        "Cardamom 3",
        "Cloves 3",
        "Salt to taste",
        "Lemon as needed",
        "Almonds ½ tsp (roasted, ground)",
        "Cashew nuts ½ tsp (roasted, ground)",
        "Coriander leaves ½ bunch",
        "Mint Leaves ½ bunch",
        "Green chili 5 or 6",
        "Brown onion"
      ],
      "instructions": [
        "Soak wheat and all lentils for whole night.",
        "Heat oil and add 1 tbsp ginger garlic paste fry for a while.",
        "Add meat, 1 tsp turmeric, red chili and Garam masala powder mix well and cover and let it cook till meat is tenderize well.",
        "When mutton tenderize add yogurt, lemon, 3 green chilies and 1 cup water simmer till oil comes on surface.",
        "Let it cool at room temperature, now shred meat and keep a side.",
        "Now in a large pan add wheat, mixed lentils, 1 tsp turmeric powder, 1 tbsp ginger garlic paste, 3 green chilies, black pepper corn give a boil and cook to tenderize all lentils.",
        "Blend all lentils and wheat in blender.",
        "In a pan heat clarified butter and crackle all whole spices (clove, cinnamon stick, black pepper corn and cardamom.",
        "Add blended lentils and meat mix and add some garnishing ingredients cook for 30 minutes to mix all ingredients well.",
        "Haleem is ready, serve with garnishing ingredients."
      ]
    },
    {
      "id": 8,
      "name": "Saag Qeema",
      "category": "Main Courses - Beef",
      "ingredients": [
        "Mince ½ kg (hand cut)",
        "Spinach ½ kg (finely chopped)",
        "Sua 2 bunch (finely chopped)",
        "Fenugreek 6 bunch (finely chopped)",
        "Turmeric ½ tsp",
        "Cooking Oil 1 cup",
        "Onion 2 (finely chopped)",
        "Turmeric 1 tbsp",
        "Red chili powder 1 tbsp",
        "Ginger garlic paste 1 tbsp",
        "Salt to taste",
        "Green chili 6",
        "Butter 1 tbsp",
        "Fresh coriander 1 bunch (finely chopped)"
      ],
      "instructions": [
        "Wash spinach, sua and fenugreek thoroughly and then soak them in water with ½ tsp of turmeric for 20 minutes.",
        "Now heat oil in a skillet and sauté onions in it.",
        "Add in 1 tbsp turmeric, red chili powder and ginger garlic paste and cook it for a while.",
        "Add in the mince and salt and let it cook with other ingredients.",
        "When the water dries out, add in all the soaked veggies and green chilies.",
        "Mix them well.",
        "Now, when the oil comes out, add in butter and cover to let it simmer.",
        "Allow excess water to dry to out then garnish with fresh coriander and serve."
      ]
    },
    {
      "id": 9,
      "name": "Shab Daig",
      "category": "Main Courses - Beef",
      "ingredients": [
        "Mutton 1 kg boneless",
        "White turnip 4",
        "Beef mince ½ kg",
        "Yogurt 1 cup",
        "Oil 1 cup",
        "Tomato 3",
        "Onion 3",
        "Lemon 3",
        "Green chili 4",
        "potato 4",
        "Fresh coriander few",
        "Turmeric 1 tsp",
        "White cumin 1 tsp (ground)",
        "Sugar 1 tsp",
        "Red chili powder 1 tbsp",
        "Chickpea 1 tbsp (roasted)",
        "Garam masala powder 2 tsp",
        "Ginger garlic paste 2 tbsp",
        "Coriander 2 tbsp",
        "Salt to taste",
        "Boil eggs 4"
      ],
      "instructions": [
        "Peel the turnips and potato and cut into four pieces.",
        "Now wash and clean the mutton meat.",
        "Then cut coriander leaves with green chillies fine.",
        "Now add oil, meat, onion, turmeric, red chilli powder, coriander powder, ginger garlic paste and little water in pot.",
        "Do the flame low and cook until meat is tender then turnoff stove.",
        "Grind roasted chickpeas and cumin then mix in mince.",
        "Add all spice powder grind the mince meat and then make small meatballs.",
        "Now fry meatballs lightly and then fry turnips and potato in same oil.",
        "Now add yogurt, sugar and tomatoes in meat pot and roast well.",
        "Then add meatballs, potato, eggs and turnips in it and simmer on low heat with 3 to 4 glass water.",
        "When the oil starts come up then add green spice, all spice powder, and lemon juice.",
        "Simmer for 5 minutes more and serve with naan."
      ]
    },
    {
      "id": 10,
      "name": "Gurday",
      "category": "Main Courses - Beef",
      "ingredients": [
        "Kidneys 12",
        "Green chilies 3 sliced",
        "Lemons 2",
        "Coriander 1 bunch (sliced)",
        "Garlic cloves 7",
        "Oil ½ cup",
        "White cumin powder 1 tsp",
        "Red chili flakes 1 tsp",
        "Ginger garlic paste 1 tbsp",
        "Black pepper ½ tsp crushed",
        "Salt to taste"
      ],
      "instructions": [
        "Chop kidney in to small pieces.",
        "Crush cloves of garlic and mix with kidneys.",
        "Keep aside for 15 minutes and then wash with cold water.",
        "In a wok, add kidneys and ginger garlic paste and allow cooking on low flame.",
        "When kidneys are dry, add red chili flakes, crushed black pepper, white cumin powder and oil and stir together.",
        "When oil forms a separate layer, add sliced coriander, sliced green chilies, salt and juice of lemons and serve hot."
      ]
    }
  ]
}